{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "border_mode": "same", "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_1", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "input_dtype": "float32", "nb_row": 5, "nb_filter": 24, "trainable": true, "batch_input_shape": [null, 40, 80, 3], "b_constraint": null, "nb_col": 5, "activation": "linear"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_1", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "elu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "border_mode": "same", "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_2", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "nb_row": 5, "nb_filter": 36, "trainable": true, "b_constraint": null, "nb_col": 5, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_2", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "elu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "border_mode": "same", "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_3", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "nb_row": 5, "nb_filter": 48, "trainable": true, "b_constraint": null, "nb_col": 5, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_3", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "elu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_4", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "nb_row": 3, "nb_filter": 64, "trainable": true, "b_constraint": null, "nb_col": 3, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "elu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_5", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "nb_row": 3, "nb_filter": 64, "trainable": true, "b_constraint": null, "nb_col": 3, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "elu", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_1", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "output_dim": 100, "trainable": true, "input_dim": 384, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "elu", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_2", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "output_dim": 50, "trainable": true, "input_dim": 100, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "elu", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_3", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "output_dim": 10, "trainable": true, "input_dim": 50, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "elu", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_4", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "output_dim": 1, "trainable": true, "input_dim": 10, "b_regularizer": null, "activation": "linear"}}]}